/**
 * @author Ilya
 * @date 08.03.2026
 */
//Задача №3. Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно
public class ex3 {
    public static void main(String[] args) {
        System.out.print("Квадраты чисел от 10 до 20: ");
        for (int i = 10; i <= 20; i++) {
            System.out.print(i * i + " ");
        }
    }
}
